In [1]:
import pandas as pd

In [5]:
characters = ['cuneyt arkin', 'saban']
names = ['serdar', 'hakan']

In [6]:
avengers = zip(characters, names)

In [7]:
## sadece print ile cikti
print(avengers)

<zip object at 0x1121e6888>

In [8]:
## * ile cikti
print(*avengers)

('cuneyt arkin', 'serdar') ('saban', 'hakan')

In [9]:
[[(n, m) for m in range(1, 2)] for n in range(7, 10)]

[[(7, 1)], [(8, 1)], [(9, 1)]]

In [11]:
print(vibe)

<str_iterator object at 0x112198978>

In [10]:
vibe = iter('Serdar Bozoglan')
print(*vibe)

S e r d a r   B o z o g l a n

In [18]:
diction = {'A':[True, False, 0], 'B':['1','2','3'], 'C':[22,13,4]}

In [19]:
df = pd.DataFrame(diction)

In [20]:
df

       A  B   C
0   True  1  22
1  False  2  13
2      0  3   4

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
A    3 non-null object
B    3 non-null object
C    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [22]:
df['A']= df['A'].astype('category')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
A    3 non-null category
B    3 non-null object
C    3 non-null int64
dtypes: category(1), int64(1), object(1)
memory usage: 227.0+ bytes

In [24]:
diction1 = {'Month':['Jan', 'Apr', 'Mar', 'Feb'], 'Count':[52,29,46,3]}

In [25]:
df2 = pd.DataFrame(diction1)

In [26]:
df2

   Count Month
0     52   Jan
1     29   Apr
2     46   Mar
3      3   Feb

In [27]:
df2.iloc[1:3]

   Count Month
1     29   Apr
2     46   Mar

In [28]:
df2.iloc[[0,3]]

   Count Month
0     52   Jan
3      3   Feb

In [32]:
df2.rename(index={0:'A', 1:'B'}, inplace=True)

In [33]:
df2

   Count Month
A     52   Jan
B     29   Apr
2     46   Mar
3      3   Feb

In [34]:
df2.rename(columns={'Month':'month'}, inplace=True)

In [35]:
df2

   Count month
A     52   Jan
B     29   Apr
2     46   Mar
3      3   Feb

In [36]:
df2.Count.quantile([0.4, 0.6])

0.4    32.4
0.6    42.6
Name: Count, dtype: float64

In [37]:
df2.index = df2.index.astype(str)

In [38]:
df2.sort_index(ascending=False)

   Count month
B     29   Apr
A     52   Jan
3      3   Feb
2     46   Mar

In [39]:
list_keys = ['Country', 'Total']
list_values = [['United States', 'Soviet Union', 'United Kingdom'], [1118, 473, 273]]

In [40]:
zipped = list(zip(list_keys, list_values))

In [41]:
data = dict(zipped)

In [42]:
df3 = pd.DataFrame(data)
df3

          Country  Total
0   United States   1118
1    Soviet Union    473
2  United Kingdom    273

In [43]:
df3.Total.values

array([1118,  473,  273])

In [44]:
df3.Country.values

array(['United States', 'Soviet Union', 'United Kingdom'], dtype=object)

In [45]:
res = df3[df3['Total']>0].all()

In [46]:
res

Country    True
Total      True
dtype: bool

In [47]:
df2.iloc[:,1]

A    Jan
B    Apr
2    Mar
3    Feb
Name: month, dtype: object

In [49]:
df2['month']

A    Jan
B    Apr
2    Mar
3    Feb
Name: month, dtype: object

In [50]:
df3['hello']= df3.Total.mul(2)

In [51]:
df3.head()

          Country  Total  hello
0   United States   1118   2236
1    Soviet Union    473    946
2  United Kingdom    273    546

In [56]:
df3['hello2'] = df3.Total.div(5)

In [57]:
df3

          Country  Total  hello  hello2
0   United States   1118   2236   223.6
1    Soviet Union    473    946    94.6
2  United Kingdom    273    546    54.6

In [60]:
df3.reindex(index=['A', 2, 'C'], )

          Country  Total  hello  hello2
A             NaN    NaN    NaN     NaN
2  United Kingdom  273.0  546.0    54.6
C             NaN    NaN    NaN     NaN

In [61]:
df3

          Country  Total  hello  hello2
0   United States   1118   2236   223.6
1    Soviet Union    473    946    94.6
2  United Kingdom    273    546    54.6

In [64]:
import numpy as np
df3[np.logical_and(df3.Total>1000, df3.hello>2000)]

         Country  Total  hello  hello2
0  United States   1118   2236   223.6

In [65]:
df3[np.logical_or(df3.Total<500, df3.hello2<100)]

          Country  Total  hello  hello2
1    Soviet Union    473    946    94.6
2  United Kingdom    273    546    54.6

In [9]:
liste = ['serdar', 'hakan', 'omer', 'anne', 'baba']

In [10]:
iterated = iter(liste)

In [11]:
print(next(iterated))
print(next(iterated))
print(next(iterated))

serdar
hakan
omer

In [12]:
print(next(iterated))

anne

In [23]:
## Reduce return a single value after operation
from functools import reduce
reduce (lambda x,y: x+y, [1,2,3,4,5])

15

In [24]:
reduce(lambda x,y : x+y, map(lambda t: t[0], [(1,2), (4,5), (6,9)]))

11

In [25]:
a = [(1,2), (3,4), (5,6)]

In [27]:
## write a function returns olnly the 2nd elements of a
list(map(lambda x:x[1],a))

[2, 4, 6]

In [28]:
reduce(lambda x, y : x+y, map(lambda z : z[1], a))

12

In [39]:
reduce (lambda x,y: x+y, map(lambda t: t[0], if t % 2 == 1, a ))

SyntaxError: invalid syntax (<ipython-input-39-7710d81b289a>, line 1)

In [37]:
list(map(lambda t: t[1], a))

[2, 4, 6]

In [47]:
list(map(lambda t: np.arange(t[0], t[1]), [(1,5), (7,10)]))

[array([1, 2, 3, 4]), array([7, 8, 9])]

In [48]:
from itertools import chain

In [51]:
print(list(chain((map(lambda t: range(t[0], t[1]), [(1,5), (7,10)])))))

[range(1, 5), range(7, 10)]

In [52]:
## FLATMAP